---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
source: html/745ef877-25f6-7508-0e19-ea733cb140fe.htm
---
# RebarShapeConstraintChordLength Properties

Specifies whether the .NET object represents a valid Revit entity.